---
kind: property
id: P:Autodesk.Revit.DB.View.UpDirection
zh: 视图
source: html/f93840a2-e22b-937f-a10b-a379ebbb2375.htm
---
# Autodesk.Revit.DB.View.UpDirection Property

**中文**: 视图

The direction towards the top of the screen.

## Syntax (C#)
```csharp
public XYZ UpDirection { get; }
```